In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('share-of-individuals-using-the-internet.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6056 entries, 0 to 6055
Data columns (total 4 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Country                                           6056 non-null   object
 1   Code                                              4912 non-null   object
 2   Year                                              6056 non-null   int64
 3   Individuals using the Internet (% of population)  6056 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 189.4+ KB

In [4]:
df.sample()

     Country Code  Year  Individuals using the Internet (% of population)
437  Belgium  BEL  2014                                              85.0

## Select dtype subset

In [5]:
df.select_dtypes(include='number')

      Year  Individuals using the Internet (% of population)
0     1990                                          0.000000
1     2001                                          0.004723
2     2002                                          0.004561
3     2003                                          0.087891
4     2004                                          0.105809
...    ...                                               ...
6051  2012                                         12.000000
6052  2013                                         15.500000
6053  2014                                         16.364740
6054  2015                                         22.742818
6055  2016                                         23.119989

[6056 rows x 2 columns]

In [9]:
df.select_dtypes(include='object')

          Country Code
0     Afghanistan  AFG
1     Afghanistan  AFG
2     Afghanistan  AFG
3     Afghanistan  AFG
4     Afghanistan  AFG
...           ...  ...
6051     Zimbabwe  ZWE
6052     Zimbabwe  ZWE
6053     Zimbabwe  ZWE
6054     Zimbabwe  ZWE
6055     Zimbabwe  ZWE

[6056 rows x 2 columns]

In [10]:
df.select_dtypes(include='object').columns.tolist()

['Country', 'Code']